# MechanicalSystemType Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MechanicalSystemType Properties
MechanicalSystemType Class See Also
---
The MechanicalSystemType type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Abbreviation | Identifies the abbreviation, the short name, for the system type  (Inherited from MEPSystemType.) |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| CalculationLevel | Identifies the calculation level for the system type.  (Inherited from MEPSystemType.) |
| CanBeCopied | Determine if this ElementType can create a copy  (Inherited from ElementType.) |
| CanBeDeleted | Determine if this ElementType can be deleted  (Inherited from ElementType.) |
| CanBeRenamed | Determine if this ElementType can be renamed  (Inherited from ElementType.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| FamilyName | Gets the family name of this element type.  (Inherited from ElementType.) |
| FillColor | Indicates the color that should override the fill color for all components in the system.  (Inherited from MEPSystemType.) |
| FillPatternId | Indicates the fill pattern id that should override the fill pattern id for all components in the system.  (Inherited from MEPSystemType.) |
| FillVisible | Indicates the visibility of the fill pattern for all components in the system.  (Inherited from MEPSystemType.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| LineColor | Indicates the color that should override the line color for all components in the system.  (Inherited from MEPSystemType.) |
| LinePatternId | Indicates the line pattern id that should override the line pattern id for all components in the system.  (Inherited from MEPSystemType.) |
| LineWeight | Indicates the weight that should override the line weight for all components in the system.  (Inherited from MEPSystemType.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| MaterialId | Indicates the material id that should override the material for all components in the system.  (Inherited from MEPSystemType.) |
| Name | Set the name for the ElementType. (Inherited from ElementType.) |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| RiseDropSettings | indicates the rise/drop symbol given the system type |
| SystemClassification | Identifies the classification for the system type  (Inherited from MEPSystemType.) |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
MechanicalSystemType Class
Autodesk.Revit.DB.Mechanical Namespace